### 빈도 및 교차 데이터 생성

In [5]:
import pandas as pd
import matplotlib as mpl
import matplotlib.pylab as plt # seaborn 사용 위해 필요
import seaborn as sns # tips 데이터가 있음
import numpy as np

In [6]:
# tips 데이터 로드
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [8]:
# Categorical Variable: sex smoker day time

In [21]:
tips[["sex"]]

        sex
0    Female
1      Male
2      Male
3      Male
4    Female
..      ...
239    Male
240  Female
241    Male
242    Male
243  Female

[244 rows x 1 columns]

In [23]:
# 빈도 집계
tips["sex"].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [24]:
tips["day"].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [25]:
tips["smoker"].value_counts()

No     151
Yes     93
Name: smoker, dtype: int64

In [26]:
tips["time"].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [30]:
# 교차 분석
pd.crosstab(tips["sex"], tips["day"]) # (row, column 순서)

day     Thur  Fri  Sat  Sun
sex
Male      30   10   59   58
Female    32    9   28   18

In [31]:
# 교차 분석 총괄표
pd.crosstab(tips["sex"], tips["day"], margins = True)

day     Thur  Fri  Sat  Sun  All
sex
Male      30   10   59   58  157
Female    32    9   28   18   87
All       62   19   87   76  244

In [32]:
tmp = pd.crosstab(tips["sex"], tips["day"], margins = True)
pd.write_excel(tmp)

AttributeError: module 'pandas' has no attribute 'write_excel'

In [42]:
# 빈도 비율 확인
pd.crosstab(tips["sex"], tips["day"]).apply(lambda r : r / len(tips["sex"]), axis = 1)

day         Thur       Fri       Sat       Sun
sex
Male    0.122951  0.040984  0.241803  0.237705
Female  0.131148  0.036885  0.114754  0.073770

In [44]:
# 컬럼별 데이터 타입 확인
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [49]:
# 기술통계
tips.describe() # 연속형 변수만 뽑아서 출력

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [78]:
tips["sex_kor"] = tips["sex"]
tips

     total_bill   tip     sex smoker   day    time  size sex_kor
0         16.99  1.01  Female     No   Sun  Dinner     2  Female
1         10.34  1.66    Male     No   Sun  Dinner     3    Male
2         21.01  3.50    Male     No   Sun  Dinner     3    Male
3         23.68  3.31    Male     No   Sun  Dinner     2    Male
4         24.59  3.61  Female     No   Sun  Dinner     4  Female
..          ...   ...     ...    ...   ...     ...   ...     ...
239       29.03  5.92    Male     No   Sat  Dinner     3    Male
240       27.18  2.00  Female    Yes   Sat  Dinner     2  Female
241       22.67  2.00    Male    Yes   Sat  Dinner     2    Male
242       17.82  1.75    Male     No   Sat  Dinner     2    Male
243       18.78  3.00  Female     No  Thur  Dinner     2  Female

[244 rows x 8 columns]

SyntaxError: invalid syntax (Temp/ipykernel_5480/1950776938.py, line 3)

In [89]:
tmp = pd.notnull(tips["tip"])
tmp.value_counts()

True    244
Name: tip, dtype: int64